Assignments.org
#+SETUPFILE: ./setup.org
#+HUGO_SECTION: assignment
#+ORG_LMS_SECTION: assignment
#+HUGO_MENU: :menu main :parent Assignments

* Reflection 02: The Ruin :assignment:
:PROPERTIES:
:EXPORT_FILE_NAME: reflection-2-the-ruin
:PUBLISH:  t
:DUE_AT: 2019-10-10
:GRADING_TYPE: points
:ASSIGNMENT_TYPE: canvas
:ASSIGNMENT_WEIGHT: 0.20
:CANVAS_SUBMISSION_TYPES: (online_upload)
:OL_PUBLISH: t
:ASSIGNMENT_TYPE: canvas
:BASECOMMIT: none
:GRADING_STANDARD_ID: nil
:ID:       831680db-1f4c-441a-9b5d-28d30066ae13
:CANVASID: 226000
:CANVAS_HTML_URL: https://q.utoronto.ca/courses/127426/assignments/226000
:CANVAS_SUBMISSION_URL: https://q.utoronto.ca/courses/127426/assignments/226000/submissions?zip=1
:SUBMISSIONS_DOWNLOAD_URL: https://q.utoronto.ca/courses/127426/assignments/226000/submissions?zip=1
:END:

Before completing this assignment, read the *recently revised, HTML version* of the handout “[[https://digitalhistory.github.io/wdw235/assignment/reflection-2-handout/][The Ruin: Digital Literary Studies]]” and carry out the exercises it asks you to do.

1. What is /The Ruin/? Briefly describe the poem and its themes. State what passage you are focusing on and analyze its poetic characteristics, as discussed in class. Be specific; cite poem by line numbers. Cite Echard's online translation correctly using the citation format of your choice.

2. What is “deformance,” as defined by McGann and Davidson, and how did you practice deformance on /The Ruin?/ Cite McGann and Davidson correctly using the citation format of your choice.

3. Describe the literary study methodology we used. Make sure you answer the following questions:

   1. What is TEI? How did we use it? (Your own words, please.)

   2. What tag did you create? What is it supposed to describe? Why did you choose it? Include at least one screenshot of the viewing screen with your TEI code, XSLT code, and results.

   3. What did you learn from making these digital artifacts that simply reading the poem did not uncover? What is the most significant affordance of your tools and digital artifacts that enabled you to gain these insights? What /failed/ to work---that is, what was difficult or counterproductive about working with TEI and XSLT?

   4. How does your analysis work /with/ or /against/ the poem---that is, are you “breaking” or “recreating” the poem? What difference does it make that you are reading an endangered poem---that is, a poem that comes down to us in fragments, in a single manuscript, in a language no longer spoken? Be as specific as possible.


** Evaluation 

This assignment is graded out of 20.

*** Intro (/4)

- A clear contextualization of /The Ruin/: its manuscript context, its historical period, and its content.

- A clear definition of “deformance” (McGann & Samuels).

*** TEI (/6)

- A clear definition of TEI in the students' own words is present (/2)

- Screenshots of TEI and XSLT code are present; output of the TEI and XSLT code is present (/2)

- Student invent their own XML tag, highlighting a consequential aspect of the poem (/2)

*** Analysis (/6)

- Discussion of imagery, stylistic devices, literary strategies, and thematics of the poem is present

- Students' observations are specific -- that is, observations could not apply to any Old English poem (“alliteration creates rhythm in the poem”) or to any text (“verbs describe the action in the poem”); instead, they point out characteristics of this particular poem.

- Using their own XML tag, students observe interesting poetic details and discuss these details' thematic effects

*** Clarity & Correctness (/4)

- Sentences are clear and vivid. Word usage, grammar, sentence structure, and punctuation are correct. Some informality is acceptable, as long as the reflection is clearly readable.

** Rubric 

- Grade :: 

| Part          | Score | out of | Comments |
|---------------+-------+--------+----------|
| Intro         |       |      4 |          |
| TEI           |       |      6 |          |
| Analysis      |       |      6 |          |
| Clear/Correct |       |      4 |          |

- General Comments :: 

