website/content/assignment/reflection-2-the-ruin.md
---
title: "Reflection 02: The Ruin"
author: ["Matt Price"]
lastmod: 2019-09-22T19:21:11-04:00
tags: ["assignment"]
draft: false
banner: "testbanner"
menu:
  main:
    weight: 1003
    identifier: "reflection-02-the-ruin"
    parent: "Assignments"
---

Before completing this assignment, read the **recently revised, HTML version** of the handout “[The Ruin: Digital Literary Studies](https://digitalhistory.github.io/wdw235/assignment/reflection-2-handout/)” and carry out the exercises it asks you to do.

1.  What is _The Ruin_? Briefly describe the poem and its themes. State what passage you are focusing on and analyze its poetic characteristics, as discussed in class. Be specific; cite poem by line numbers. Cite Echard's online translation correctly using the citation format of your choice.

2.  What is “deformance,” as defined by McGann and Davidson, and how did you practice deformance on _The Ruin?_ Cite McGann and Davidson correctly using the citation format of your choice.

3.  Describe the literary study methodology we used. Make sure you answer the following questions:
    1.  What is TEI? How did we use it? (Your own words, please.)

    2.  What tag did you create? What is it supposed to describe? Why did you choose it? Include at least one screenshot of the viewing screen with your TEI code, XSLT code, and results.

    3.  What did you learn from making these digital artifacts that simply reading the poem did not uncover? What is the most significant affordance of your tools and digital artifacts that enabled you to gain these insights? What _failed_ to work---that is, what was difficult or counterproductive about working with TEI and XSLT?

    4.  How does your analysis work _with_ or _against_ the poem---that is, are you “breaking” or “recreating” the poem? What difference does it make that you are reading an endangered poem---that is, a poem that comes down to us in fragments, in a single manuscript, in a language no longer spoken? Be as specific as possible.


## Evaluation {#evaluation}

This assignment is graded out of 20.


### Intro (/4) {#intro--4}

-   A clear contextualization of _The Ruin_: its manuscript context, its historical period, and its content.

-   A clear definition of “deformance” (McGann & Samuels).


### TEI (/6) {#tei--6}

-   A clear definition of TEI in the students' own words is present (/2)

-   Screenshots of TEI and XSLT code are present; output of the TEI and XSLT code is present (/2)

-   Student invent their own XML tag, highlighting a consequential aspect of the poem (/2)


### Analysis (/6) {#analysis--6}

-   Discussion of imagery, stylistic devices, literary strategies, and thematics of the poem is present

-   Students' observations are specific -- that is, observations could not apply to any Old English poem (“alliteration creates rhythm in the poem”) or to any text (“verbs describe the action in the poem”); instead, they point out characteristics of this particular poem.

-   Using their own XML tag, students observe interesting poetic details and discuss these details' thematic effects


### Clarity & Correctness (/4) {#clarity-and-correctness--4}

-   Sentences are clear and vivid. Word usage, grammar, sentence structure, and punctuation are correct. Some informality is acceptable, as long as the reflection is clearly readable.
